Alvin0523/mdp_stm32/src/main.c
/**
 * @file main.c
 * @brief STM32F407VET6 Main Program Entrypoint (WHEELTEC C30D Board)
 */

#include <stdio.h>
#include "stm32f4xx_hal.h"
#include "usart.h"
#include "motor.h"
#include "encoder.h"
#include "oled.h"
#include "button.h"
#include "imu.h"

void SystemClock_Config(void);

void SysTick_Handler(void)
{
    HAL_IncTick();
}

int main(void)
{
    HAL_Init();
    SystemClock_Config();

    /* Status LED PE8 Initialization */
    __HAL_RCC_GPIOE_CLK_ENABLE();
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = GPIO_PIN_8;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    /* Initialize Peripherals: USART3, Motors, OLED, PE0 Button, ICM-20948 IMU */
    MX_USART3_UART_Init();

    if (motor_init() != 0) {
        printf("Motor PWM initialization failed\r\n");
        while (1) {
            HAL_GPIO_TogglePin(GPIOE, GPIO_PIN_8);
            HAL_Delay(100);
        }
    }

    encoder_init();

    /* Servo test: direct pulses, avoiding angle conversion during diagnosis. */
    /* Keep the traction motors stopped while checking steering power. */
    motor_set_speed(MOTOR_A, 0);
    motor_set_speed(MOTOR_B, 0);
    printf("[Steering] command 1000 us\r\n");
    motor_set_steering_pulse_us(1000U);
    HAL_Delay(2000);
    printf("[Steering] command 1500 us\r\n");
    motor_set_steering_pulse_us(1500U);
    HAL_Delay(2000);
    printf("[Steering] command 2000 us\r\n");
    motor_set_steering_pulse_us(2000U);
    HAL_Delay(2000);
    printf("[Steering] command 1500 us\r\n");
    motor_set_steering_pulse_us(1500U);

    float steering_angle_rad = 0.0f;

    oled_init();
    button_init();
    int imu_status = imu_init();

    printf("\r\n=======================================================\r\n");
    printf("  WHEELTEC C30D Board Bringup (PlatformIO + STM32 HAL) \r\n");
    printf("  MCU: STM32F407VET6 @ 168 MHz                          \r\n");
    printf("  IMU Sensor: ICM-20948 (I2C2 PB10/PB11) -> %s        \r\n", imu_status == 0 ? "DETECTED OK" : "NOT DETECTED");
    printf("  OLED: 0.96-inch 128x64 (PD11/12/13/14)                \r\n");
    printf("  Button: PE0 EXTI Interrupt (Page Switcher)            \r\n");
    printf("[Steering] commanded angle: %.3f rad / %.1f deg\r\n",
        steering_angle_rad, steering_angle_rad * 57.2958f);
    printf("=======================================================\r\n\r\n");

    uint32_t loop_count = 0;
    uint32_t last_encoder_report = 0;

    while (1)
    {
        HAL_GPIO_TogglePin(GPIOE, GPIO_PIN_8); // Toggle PE8 LED
        loop_count++;

        if (HAL_GetTick() - last_encoder_report >= 1000) {
            int32_t left_count = encoder_get_left_count();
            int32_t right_count = encoder_get_right_count();
            printf("[Encoders] left=%ld right=%ld\r\n",
                   (long)left_count, (long)right_count);
            last_encoder_report = HAL_GetTick();
        }

        /* Update IMU telemetry */
        imu_update();

        /* Render Current OLED Display Page based on g_oled_page */
        switch (g_oled_page) {
            case 0:
                /* Page 1: Primary Drive & Battery Status */
                oled_render_page1(12.4f, 0.25f, 0.25f, +0.0f, g_imu_data.yaw);
                break;

            case 1:
                /* Page 2: Distance Sensors (Ultrasonic & IR) */
                oled_render_page2(18.5f, 22.0f, 24.5f);
                break;

            case 2:
                /* Page 3: Safety & Hardware Diagnostics */
                oled_render_page3(0,
                                  encoder_get_left_count(),
                                  encoder_get_right_count(),
                                  loop_count / 2);
                break;

            case 3:
                /* Page 4: Bezel Alignment Calibration Test Page */
                oled_render_page4();
                break;

            default:
                g_oled_page = 0;
                break;
        }

        // printf("[IMU Telemetry] Yaw: %+6.1f deg | GyroZ: %+6.1f deg/s | AccelX: %+5.2f m/s^2 | Page: %d\r\n",
        //        g_imu_data.yaw, g_imu_data.gyro_z, g_imu_data.accel_x, g_oled_page + 1);

        HAL_Delay(100); /* 10 Hz refresh rate for smooth IMU telemetry */
    }
}

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    __HAL_RCC_PWR_CLK_ENABLE();
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLM = 8;
    RCC_OscInitStruct.PLL.PLLN = 336;
    RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
    RCC_OscInitStruct.PLL.PLLQ = 7;
    HAL_RCC_OscConfig(&RCC_OscInitStruct);

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK |
                                  RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
    HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
}
